name: "FDMNet"
input: "data_im"
input_dim: 1
input_dim: 3
input_dim: 288
input_dim: 288

input: "data_FDM"
input_dim: 1
input_dim: 1
input_dim: 288
input_dim: 288


#######################################################################
##                              VGG16                                ##
#######################################################################
layer {
  bottom: "data_im"
  top: "conv1_1"
  name: "conv1_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv1_1"
  top: "conv1_1"
  name: "conv1_1_bn"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "conv1_1"
  top: "conv1_1"
  name: "relu1_1"
  type: "ReLU"
}
layer {
  bottom: "conv1_1"
  top: "conv1_2"
  name: "conv1_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 64
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv1_2"
  top: "conv1_2"
  name: "conv1_2_bn"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "conv1_2"
  top: "conv1_2"
  name: "relu1_2"
  type: "ReLU"
}
layer {
  bottom: "conv1_2"
  top: "pool1"
  name: "pool1"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool1"
  top: "conv2_1"
  name: "conv2_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv2_1"
  top: "conv2_1"
  name: "conv2_1_bn"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "conv2_1"
  top: "conv2_1"
  name: "relu2_1"
  type: "ReLU"
}
layer {
  bottom: "conv2_1"
  top: "conv2_2"
  name: "conv2_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 128
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv2_2"
  top: "conv2_2"
  name: "conv2_2_bn"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "conv2_2"
  top: "conv2_2"
  name: "relu2_2"
  type: "ReLU"
}
layer {
  bottom: "conv2_2"
  top: "pool2"
  name: "pool2"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool2"
  top: "conv3_1"
  name: "conv3_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_1"
  top: "conv3_1"
  name: "conv3_1_bn"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "conv3_1"
  top: "conv3_1"
  name: "relu3_1"
  type: "ReLU"
}
layer {
  bottom: "conv3_1"
  top: "conv3_2"
  name: "conv3_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_2"
  top: "conv3_2"
  name: "conv3_2_bn"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "conv3_2"
  top: "conv3_2"
  name: "relu3_2"
  type: "ReLU"
}
layer {
  bottom: "conv3_2"
  top: "conv3_3"
  name: "conv3_3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 256
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv3_3"
  top: "conv3_3"
  name: "conv3_3_bn"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "conv3_3"
  top: "conv3_3"
  name: "relu3_3"
  type: "ReLU"
}
layer {
  bottom: "conv3_3"
  top: "pool3"
  name: "pool3"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool3"
  top: "conv4_1"
  name: "conv4_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_1"
  top: "conv4_1"
  name: "conv4_1_bn"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "conv4_1"
  top: "conv4_1"
  name: "relu4_1"
  type: "ReLU"
}
layer {
  bottom: "conv4_1"
  top: "conv4_2"
  name: "conv4_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_2"
  top: "conv4_2"
  name: "conv4_2_bn"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "conv4_2"
  top: "conv4_2"
  name: "relu4_2"
  type: "ReLU"
}
layer {
  bottom: "conv4_2"
  top: "conv4_3"
  name: "conv4_3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv4_3"
  top: "conv4_3"
  name: "conv4_3_bn"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "conv4_3"
  top: "conv4_3"
  name: "relu4_3"
  type: "ReLU"
}
layer {
  bottom: "conv4_3"
  top: "pool4"
  name: "pool4"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "pool4"
  top: "conv5_1"
  name: "conv5_1"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_1"
  top: "conv5_1"
  name: "conv5_1_bn"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "conv5_1"
  top: "conv5_1"
  name: "relu5_1"
  type: "ReLU"
}
layer {
  bottom: "conv5_1"
  top: "conv5_2"
  name: "conv5_2"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_2"
  top: "conv5_2"
  name: "conv5_2_bn"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "conv5_2"
  top: "conv5_2"
  name: "relu5_2"
  type: "ReLU"
}
layer {
  bottom: "conv5_2"
  top: "conv5_3"
  name: "conv5_3"
  type: "Convolution"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 512
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "conv5_3"
  top: "conv5_3"
  name: "conv5_3_bn"
  type: "BN"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "conv5_3"
  top: "conv5_3"
  name: "relu5_3"
  type: "ReLU"
}
########## using 1x1 conv for scale 1/16 prediction ########
#32x32
layer {
  bottom: "conv5_3"
  top: "conv5_3_D_s1/16"
  name: "conv5_3_D_s1/16"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 64
    kernel_size: 1
    stride: 1
  }
}
layer {
  bottom: "conv5_3_D_s1/16"
  top: "conv5_3_D_s1/16"
  name: "conv5_3_D_s1/16_bn"
  type: "BN"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "conv5_3_D_s1/16"
  top: "conv5_3_D_s1/16"
  name: "relu_conv5_3_D_s1/16"
  type: "ReLU"
}
layer {
  bottom: "conv4_3"
  top: "conv4_3_D_s1/16"
  name: "conv4_3_D_s1/16"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 64
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "conv4_3_D_s1/16"
  top: "conv4_3_D_s1/16"
  name: "conv4_3_D_s1/16_bn"
  type: "BN"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "conv4_3_D_s1/16"
  top: "conv4_3_D_s1/16"
  name: "relu_conv4_3_D_s1/16"
  type: "ReLU"
}
layer {
  bottom: "conv3_3"
  top: "conv3_3_D_s1/16"
  name: "conv3_3_D_s1/16"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 64
    kernel_size: 4
    stride: 4
  }
}
layer {
  bottom: "conv3_3_D_s1/16"
  top: "conv3_3_D_s1/16"
  name: "conv3_3_D_s1/16_bn"
  type: "BN"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "conv3_3_D_s1/16"
  top: "conv3_3_D_s1/16"
  name: "relu_conv3_3_D_s1/16"
  type: "ReLU"
}
layer {
  bottom: "conv2_2"
  top: "conv2_2_D_s1/16"
  name: "conv2_2_D_s1/16"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 64
    kernel_size: 8
    stride: 8
  }
}
layer {
  bottom: "conv2_2_D_s1/16"
  top: "conv2_2_D_s1/16"
  name: "conv2_2_D_s1/16_bn"
  type: "BN"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "conv2_2_D_s1/16"
  top: "conv2_2_D_s1/16"
  name: "relu_conv2_2_D_s1/16"
  type: "ReLU"
}
layer {
  bottom: "conv1_2"
  top: "conv1_2_D_s1/16"
  name: "conv1_2_D_s1/16"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 64
    kernel_size: 16
    stride: 16
  }
}
layer {
  bottom: "conv1_2_D_s1/16"
  top: "conv1_2_D_s1/16"
  name: "conv1_2_D_s1/16_bn"
  type: "BN"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "conv1_2_D_s1/16"
  top: "conv1_2_D_s1/16"
  name: "relu_conv1_2_D_s1/16"
  type: "ReLU"
}
layer {
  bottom: "data_FDM"
  top: "data_FDM_1/16"
  name: "pool_1/16"
  type: "Pooling"
  pooling_param {
    pool: MAX
    kernel_size: 16
    stride: 16
  }
}
layer {
  name: "concat_s1/16"
  type: "Concat"
  bottom: "conv1_2_D_s1/16"
  bottom: "conv2_2_D_s1/16"
  bottom: "conv3_3_D_s1/16"
  bottom: "conv4_3_D_s1/16"
  bottom: "conv5_3_D_s1/16"
  top: "concat_s1/16"
}
layer {
  bottom: "concat_s1/16"
  top: "conv_com_s1/16_dila_1"
  name: "conv_com_s1/16_dila_1"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
    dilation: 1
  }
}
layer {
  bottom: "conv_com_s1/16_dila_1"
  top: "conv_com_s1/16_dila_1"
  name: "conv_com_s1/16_dila_1_bn"
  type: "BN"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "concat_s1/16"
  top: "conv_com_s1/16_dila_2"
  name: "conv_com_s1/16_dila_2"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 2
    kernel_size: 3
    dilation: 2
  }
}
layer {
  bottom: "conv_com_s1/16_dila_2"
  top: "conv_com_s1/16_dila_2"
  name: "conv_com_s1/16_dila_2_bn"
  type: "BN"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}

layer {
  bottom: "concat_s1/16"
  top: "conv_com_s1/16_dila_3"
  name: "conv_com_s1/16_dila_3"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 3
    kernel_size: 3
    dilation: 3
  }
}
layer {
  bottom: "conv_com_s1/16_dila_3"
  top: "conv_com_s1/16_dila_3"
  name: "conv_com_s1/16_dila_3_bn"
  type: "BN"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  name: "concat_s1/16_dila"
  type: "Concat"
  bottom: "conv_com_s1/16_dila_1"
  bottom: "conv_com_s1/16_dila_2"
  bottom: "conv_com_s1/16_dila_3"
  top: "concat_s1/16_dila"
}
layer {
  name: "sigmoid_conv_com_s1/16"
  bottom: "concat_s1/16_dila"
  top: "sigmoid_conv_com_s1/16"
  type: "Sigmoid"
}
layer {
  name: "concat_s1/16_FDM"
  type: "Concat"
  bottom: "data_FDM_1/16"
  bottom: "sigmoid_conv_com_s1/16"
  top: "concat_s1/16_FDM"
}
################
### convLSTM-1/16 ###
################

## i0 ##
layer {
  bottom: "concat_s1/16_FDM"
  top: "conv_s1/16_i0"
  name: "conv_s1/16_i0"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "sigmoid_s1/16_i0"
  bottom: "conv_s1/16_i0"
  top: "sigmoid_s1/16_i0"
  type: "Sigmoid"
}

## f0 ##
layer {
  bottom: "concat_s1/16_FDM"
  top: "conv_s1/16_f0"
  name: "conv_s1/16_f0"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "sigmoid_s1/16_f0"
  bottom: "conv_s1/16_f0"
  top: "sigmoid_s1/16_f0"
  type: "Sigmoid"
}


## o0 ##
layer {
  bottom: "concat_s1/16_FDM"
  top: "conv_s1/16_o0"
  name: "conv_s1/16_o0"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "sigmoid_s1/16_o0"
  bottom: "conv_s1/16_o0"
  top: "sigmoid_s1/16_o0"
  type: "Sigmoid"
}

## c0 ##
layer {
  bottom: "concat_s1/16_FDM"
  top: "conv_s1/16_c0_tanh_left"
  name: "conv_s1/16_c0_tanh_left"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "tanh_conv_s1/16_c0"
  bottom: "conv_s1/16_c0_tanh_left"
  top: "tanh_conv_s1/16_c0"
  type: "TanH"
}
layer {
  name: "eltwise_s1/16_c0_right"
  type: "Eltwise"
  bottom: "sigmoid_s1/16_i0"
  bottom: "tanh_conv_s1/16_c0"
  top: "eltwise_s1/16_c0_right"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "eltwise_s1/16_c0"
  type: "Eltwise"
  bottom: "sigmoid_s1/16_f0"
  bottom: "eltwise_s1/16_c0_right"
  top: "eltwise_s1/16_c0"
  eltwise_param {
    operation: SUM
  }
}

## h0 ##
layer {
  name: "tanh_s1/16_c0"
  bottom: "eltwise_s1/16_c0"
  top: "tanh_s1/16_c0"
  type: "TanH"
}
layer {
  name: "eltwise_s1/16_h0"
  type: "Eltwise"
  bottom: "sigmoid_s1/16_o0"
  bottom: "tanh_s1/16_c0"
  top: "eltwise_s1/16_h0"
  eltwise_param {
    operation: PROD
  }
}

## i1 ##
layer {
  bottom: "concat_s1/16_FDM"
  top: "conv_s1/16_i1_left"
  name: "conv_s1/16_i1_left"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "eltwise_s1/16_h0"
  top: "conv_s1/16_i1_right"
  name: "conv_s1/16_i1_right"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "conv_s1/16_i1"
  type: "Eltwise"
  bottom: "conv_s1/16_i1_left"
  bottom: "conv_s1/16_i1_right"
  top: "conv_s1/16_i1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "sigmoid_s1/16_i1"
  bottom: "conv_s1/16_i1"
  top: "sigmoid_s1/16_i1"
  type: "Sigmoid"
}

## f1 ##
layer {
  bottom: "concat_s1/16_FDM"
  top: "conv_s1/16_f1_left"
  name: "conv_s1/16_f1_left"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "eltwise_s1/16_h0"
  top: "conv_s1/16_f1_right"
  name: "conv_s1/16_f1_right"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "conv_s1/16_f1"
  type: "Eltwise"
  bottom: "conv_s1/16_f1_left"
  bottom: "conv_s1/16_f1_right"
  top: "conv_s1/16_f1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "sigmoid_s1/16_f1"
  bottom: "conv_s1/16_f1"
  top: "sigmoid_s1/16_f1"
  type: "Sigmoid"
}


## o1 ##
layer {
  bottom: "concat_s1/16_FDM"
  top: "conv_s1/16_o1_left"
  name: "conv_s1/16_o1_left"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "eltwise_s1/16_h0"
  top: "conv_s1/16_o1_right"
  name: "conv_s1/16_o1_right"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "conv_s1/16_o1"
  type: "Eltwise"
  bottom: "conv_s1/16_o1_left"
  bottom: "conv_s1/16_o1_right"
  top: "conv_s1/16_o1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "sigmoid_s1/16_o1"
  bottom: "conv_s1/16_o1"
  top: "sigmoid_s1/16_o1"
  type: "Sigmoid"
}

## c1 ##
layer {
  bottom: "concat_s1/16_FDM"
  top: "conv_s1/16_c1_tanh_left"
  name: "conv_s1/16_c1_tanh_left"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "eltwise_s1/16_h0"
  top: "conv_s1/16_c1_tanh_right"
  name: "conv_s1/16_c1_tanh_right"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "conv_s1/16_c1_tanh"
  type: "Eltwise"
  bottom: "conv_s1/16_c1_tanh_left"
  bottom: "conv_s1/16_c1_tanh_right"
  top: "conv_s1/16_c1_tanh"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "tanh_conv_s1/16_c1"
  bottom: "conv_s1/16_c1_tanh"
  top: "tanh_conv_s1/16_c1"
  type: "TanH"
}
layer {
  name: "eltwise_s1/16_c1_right"
  type: "Eltwise"
  bottom: "sigmoid_s1/16_i1"
  bottom: "tanh_conv_s1/16_c1"
  top: "eltwise_s1/16_c1_right"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "eltwise_s1/16_c1_left"
  type: "Eltwise"
  bottom: "sigmoid_s1/16_f1"
  bottom: "eltwise_s1/16_c0"
  top: "eltwise_s1/16_c1_left"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "eltwise_s1/16_c1"
  type: "Eltwise"
  bottom: "eltwise_s1/16_c1_left"
  bottom: "eltwise_s1/16_c1_right"
  top: "eltwise_s1/16_c1"
  eltwise_param {
    operation: SUM
  }
}


## h1 ##
layer {
  name: "tanh_s1/16_c1"
  bottom: "eltwise_s1/16_c1"
  top: "tanh_s1/16_c1"
  type: "TanH"
}
layer {
  name: "eltwise_s1/16_h1"
  type: "Eltwise"
  bottom: "sigmoid_s1/16_o1"
  bottom: "tanh_s1/16_c1"
  top: "eltwise_s1/16_h1"
  eltwise_param {
    operation: PROD
  }
}

## i2 ##
layer {
  bottom: "concat_s1/16_FDM"
  top: "conv_s1/16_i2_left"
  name: "conv_s1/16_i2_left"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "eltwise_s1/16_h1"
  top: "conv_s1/16_i2_right"
  name: "conv_s1/16_i2_right"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "conv_s1/16_i2"
  type: "Eltwise"
  bottom: "conv_s1/16_i2_left"
  bottom: "conv_s1/16_i2_right"
  top: "conv_s1/16_i2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "sigmoid_s1/16_i2"
  bottom: "conv_s1/16_i2"
  top: "sigmoid_s1/16_i2"
  type: "Sigmoid"
}

## f2 ##
layer {
  bottom: "concat_s1/16_FDM"
  top: "conv_s1/16_f2_left"
  name: "conv_s1/16_f2_left"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "eltwise_s1/16_h1"
  top: "conv_s1/16_f2_right"
  name: "conv_s1/16_f2_right"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "conv_s1/16_f2"
  type: "Eltwise"
  bottom: "conv_s1/16_f2_left"
  bottom: "conv_s1/16_f2_right"
  top: "conv_s1/16_f2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "sigmoid_s1/16_f2"
  bottom: "conv_s1/16_f2"
  top: "sigmoid_s1/16_f2"
  type: "Sigmoid"
}


## o2 ##
layer {
  bottom: "concat_s1/16_FDM"
  top: "conv_s1/16_o2_left"
  name: "conv_s1/16_o2_left"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "eltwise_s1/16_h1"
  top: "conv_s1/16_o2_right"
  name: "conv_s1/16_o2_right"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "conv_s1/16_o2"
  type: "Eltwise"
  bottom: "conv_s1/16_o2_left"
  bottom: "conv_s1/16_o2_right"
  top: "conv_s1/16_o2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "sigmoid_s1/16_o2"
  bottom: "conv_s1/16_o2"
  top: "sigmoid_s1/16_o2"
  type: "Sigmoid"
}

## c2 ##
layer {
  bottom: "concat_s1/16_FDM"
  top: "conv_s1/16_c2_tanh_left"
  name: "conv_s1/16_c2_tanh_left"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "eltwise_s1/16_h1"
  top: "conv_s1/16_c2_tanh_right"
  name: "conv_s1/16_c2_tanh_right"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "conv_s1/16_c2_tanh"
  type: "Eltwise"
  bottom: "conv_s1/16_c2_tanh_left"
  bottom: "conv_s1/16_c2_tanh_right"
  top: "conv_s1/16_c2_tanh"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "tanh_conv_s1/16_c2"
  bottom: "conv_s1/16_c2_tanh"
  top: "tanh_conv_s1/16_c2"
  type: "TanH"
}
layer {
  name: "eltwise_s1/16_c2_right"
  type: "Eltwise"
  bottom: "sigmoid_s1/16_i2"
  bottom: "tanh_conv_s1/16_c2"
  top: "eltwise_s1/16_c2_right"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "eltwise_s1/16_c2_left"
  type: "Eltwise"
  bottom: "sigmoid_s1/16_f2"
  bottom: "eltwise_s1/16_c1"
  top: "eltwise_s1/16_c2_left"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "eltwise_s1/16_c2"
  type: "Eltwise"
  bottom: "eltwise_s1/16_c2_left"
  bottom: "eltwise_s1/16_c2_right"
  top: "eltwise_s1/16_c2"
  eltwise_param {
    operation: SUM
  }
}


## h2 ##
layer {
  name: "tanh_s1/16_c2"
  bottom: "eltwise_s1/16_c2"
  top: "tanh_s1/16_c2"
  type: "TanH"
}
layer {
  name: "eltwise_s1/16_h2"
  type: "Eltwise"
  bottom: "sigmoid_s1/16_o2"
  bottom: "tanh_s1/16_c2"
  top: "eltwise_s1/16_h2"
  eltwise_param {
    operation: PROD
  }
}

## output1 ##
layer {
  bottom: "eltwise_s1/16_h2"
  top: "conv_s1/16"
  name: "conv_s1/16"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 2
    kernel_size: 1
    stride: 1
  }
}
layer {
  name: "sigmoid_conv_s1/16"
  bottom: "conv_s1/16"
  top: "conv_s1/16_salmap"
  type: "Sigmoid"
}

### convLSTM-1/16 ###

layer {
  bottom: "conv_s1/16_salmap"
  top: "conv_s1/16_salmap-16"
  name: "conv_s1/16_salmap-16"
  type: "Deconvolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 2
    kernel_size: 16
    stride: 16
  }
}


layer {
  bottom: "conv_s1/16_salmap"
  top: "conv_upsample_s1/16"
  name: "conv_upsample_s1/16"
  type: "Deconvolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 2
    kernel_size: 2
    stride: 2
  }
}

########## using 1x1 conv for scale 1/8 prediction ########
#64x64
layer {
  bottom: "conv5_3"
  top: "conv5_3_D_s1/8"
  name: "conv5_3_D_s1/8"
  type: "Deconvolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 64
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "conv5_3_D_s1/8"
  top: "conv5_3_D_s1/8"
  name: "conv5_3_D_s1/8_bn"
  type: "BN"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "conv5_3_D_s1/8"
  top: "conv5_3_D_s1/8"
  name: "relu_conv5_3_D_s1/8"
  type: "ReLU"
}
layer {
  bottom: "conv4_3"
  top: "conv4_3_D_s1/8"
  name: "conv4_3_D_s1/8"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 64
    kernel_size: 1
    stride: 1
  }
}
layer {
  bottom: "conv4_3_D_s1/8"
  top: "conv4_3_D_s1/8"
  name: "conv4_3_D_s1/8_bn"
  type: "BN"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "conv4_3_D_s1/8"
  top: "conv4_3_D_s1/8"
  name: "relu_conv4_3_D_s1/8"
  type: "ReLU"
}
layer {
  bottom: "conv3_3"
  top: "conv3_3_D_s1/8"
  name: "conv3_3_D_s1/8"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 64
    kernel_size: 2
    stride: 2
  }
}
layer {
  bottom: "conv3_3_D_s1/8"
  top: "conv3_3_D_s1/8"
  name: "conv3_3_D_s1/8_bn"
  type: "BN"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "conv3_3_D_s1/8"
  top: "conv3_3_D_s1/8"
  name: "relu_conv3_3_D_s1/8"
  type: "ReLU"
}
layer {
  bottom: "conv2_2"
  top: "conv2_2_D_s1/8"
  name: "conv2_2_D_s1/8"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 64
    kernel_size: 4
    stride: 4
  }
}
layer {
  bottom: "conv2_2_D_s1/8"
  top: "conv2_2_D_s1/8"
  name: "conv2_2_D_s1/8_bn"
  type: "BN"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "conv2_2_D_s1/8"
  top: "conv2_2_D_s1/8"
  name: "relu_conv2_2_D_s1/8"
  type: "ReLU"
}
layer {
  bottom: "conv1_2"
  top: "conv1_2_D_s1/8"
  name: "conv1_2_D_s1/8"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 64
    kernel_size: 8
    stride: 8
  }
}
layer {
  bottom: "conv1_2_D_s1/8"
  top: "conv1_2_D_s1/8"
  name: "conv1_2_D_s1/8_bn"
  type: "BN"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "conv1_2_D_s1/8"
  top: "conv1_2_D_s1/8"
  name: "relu_conv1_2_D_s1/8"
  type: "ReLU"
}
layer {
  name: "concat_s1/8"
  type: "Concat"
  bottom: "conv1_2_D_s1/8"
  bottom: "conv2_2_D_s1/8"
  bottom: "conv3_3_D_s1/8"
  bottom: "conv4_3_D_s1/8"
  bottom: "conv5_3_D_s1/8"
  top: "concat_s1/8"
}
layer {
  bottom: "concat_s1/8"
  top: "conv_com_s1/8_dila_1"
  name: "conv_com_s1/8_dila_1"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
    dilation: 1
  }
}
layer {
  bottom: "conv_com_s1/8_dila_1"
  top: "conv_com_s1/8_dila_1"
  name: "conv_com_s1/8_dila_1_bn"
  type: "BN"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  bottom: "concat_s1/8"
  top: "conv_com_s1/8_dila_2"
  name: "conv_com_s1/8_dila_2"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 2
    kernel_size: 3
    dilation: 2
  }
}
layer {
  bottom: "conv_com_s1/8_dila_2"
  top: "conv_com_s1/8_dila_2"
  name: "conv_com_s1/8_dila_2_bn"
  type: "BN"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}

layer {
  bottom: "concat_s1/8"
  top: "conv_com_s1/8_dila_3"
  name: "conv_com_s1/8_dila_3"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 3
    kernel_size: 3
    dilation: 3
  }
}
layer {
  bottom: "conv_com_s1/8_dila_3"
  top: "conv_com_s1/8_dila_3"
  name: "conv_com_s1/8_dila_3_bn"
  type: "BN"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  bn_param {
	bn_mode: LEARN
	scale_filler {
	  type: "constant"
	  value: 1
	}
	shift_filler {
	  type: "constant"
	  value: 0
	}
 }
}
layer {
  name: "concat_s1/8_dila"
  type: "Concat"
  bottom: "conv_com_s1/8_dila_1"
  bottom: "conv_com_s1/8_dila_2"
  bottom: "conv_com_s1/8_dila_3"
  top: "concat_s1/8_dila"
}
layer {
  name: "sigmoid_conv_com_s1/8"
  bottom: "concat_s1/8_dila"
  top: "sigmoid_conv_com_s1/8"
  type: "Sigmoid"
}
layer {
  name: "concat_s1/8_FDM"
  type: "Concat"
  bottom: "conv_upsample_s1/16"
  bottom: "sigmoid_conv_com_s1/8"
  top: "concat_s1/8_FDM"
}

################
### convLSTM-1/8 ###
################

## i0 ##
layer {
  bottom: "concat_s1/8_FDM"
  top: "conv_s1/8_i0"
  name: "conv_s1/8_i0"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "sigmoid_s1/8_i0"
  bottom: "conv_s1/8_i0"
  top: "sigmoid_s1/8_i0"
  type: "Sigmoid"
}

## f0 ##
layer {
  bottom: "concat_s1/8_FDM"
  top: "conv_s1/8_f0"
  name: "conv_s1/8_f0"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "sigmoid_s1/8_f0"
  bottom: "conv_s1/8_f0"
  top: "sigmoid_s1/8_f0"
  type: "Sigmoid"
}


## o0 ##
layer {
  bottom: "concat_s1/8_FDM"
  top: "conv_s1/8_o0"
  name: "conv_s1/8_o0"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "sigmoid_s1/8_o0"
  bottom: "conv_s1/8_o0"
  top: "sigmoid_s1/8_o0"
  type: "Sigmoid"
}

## c0 ##
layer {
  bottom: "concat_s1/8_FDM"
  top: "conv_s1/8_c0_tanh_left"
  name: "conv_s1/8_c0_tanh_left"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "tanh_conv_s1/8_c0"
  bottom: "conv_s1/8_c0_tanh_left"
  top: "tanh_conv_s1/8_c0"
  type: "TanH"
}
layer {
  name: "eltwise_s1/8_c0_right"
  type: "Eltwise"
  bottom: "sigmoid_s1/8_i0"
  bottom: "tanh_conv_s1/8_c0"
  top: "eltwise_s1/8_c0_right"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "eltwise_s1/8_c0"
  type: "Eltwise"
  bottom: "sigmoid_s1/8_f0"
  bottom: "eltwise_s1/8_c0_right"
  top: "eltwise_s1/8_c0"
  eltwise_param {
    operation: SUM
  }
}

## h0 ##
layer {
  name: "tanh_s1/8_c0"
  bottom: "eltwise_s1/8_c0"
  top: "tanh_s1/8_c0"
  type: "TanH"
}
layer {
  name: "eltwise_s1/8_h0"
  type: "Eltwise"
  bottom: "sigmoid_s1/8_o0"
  bottom: "tanh_s1/8_c0"
  top: "eltwise_s1/8_h0"
  eltwise_param {
    operation: PROD
  }
}

## i1 ##
layer {
  bottom: "concat_s1/8_FDM"
  top: "conv_s1/8_i1_left"
  name: "conv_s1/8_i1_left"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "eltwise_s1/8_h0"
  top: "conv_s1/8_i1_right"
  name: "conv_s1/8_i1_right"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "conv_s1/8_i1"
  type: "Eltwise"
  bottom: "conv_s1/8_i1_left"
  bottom: "conv_s1/8_i1_right"
  top: "conv_s1/8_i1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "sigmoid_s1/8_i1"
  bottom: "conv_s1/8_i1"
  top: "sigmoid_s1/8_i1"
  type: "Sigmoid"
}

## f1 ##
layer {
  bottom: "concat_s1/8_FDM"
  top: "conv_s1/8_f1_left"
  name: "conv_s1/8_f1_left"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "eltwise_s1/8_h0"
  top: "conv_s1/8_f1_right"
  name: "conv_s1/8_f1_right"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "conv_s1/8_f1"
  type: "Eltwise"
  bottom: "conv_s1/8_f1_left"
  bottom: "conv_s1/8_f1_right"
  top: "conv_s1/8_f1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "sigmoid_s1/8_f1"
  bottom: "conv_s1/8_f1"
  top: "sigmoid_s1/8_f1"
  type: "Sigmoid"
}


## o1 ##
layer {
  bottom: "concat_s1/8_FDM"
  top: "conv_s1/8_o1_left"
  name: "conv_s1/8_o1_left"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "eltwise_s1/8_h0"
  top: "conv_s1/8_o1_right"
  name: "conv_s1/8_o1_right"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "conv_s1/8_o1"
  type: "Eltwise"
  bottom: "conv_s1/8_o1_left"
  bottom: "conv_s1/8_o1_right"
  top: "conv_s1/8_o1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "sigmoid_s1/8_o1"
  bottom: "conv_s1/8_o1"
  top: "sigmoid_s1/8_o1"
  type: "Sigmoid"
}

## c1 ##
layer {
  bottom: "concat_s1/8_FDM"
  top: "conv_s1/8_c1_tanh_left"
  name: "conv_s1/8_c1_tanh_left"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "eltwise_s1/8_h0"
  top: "conv_s1/8_c1_tanh_right"
  name: "conv_s1/8_c1_tanh_right"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "conv_s1/8_c1_tanh"
  type: "Eltwise"
  bottom: "conv_s1/8_c1_tanh_left"
  bottom: "conv_s1/8_c1_tanh_right"
  top: "conv_s1/8_c1_tanh"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "tanh_conv_s1/8_c1"
  bottom: "conv_s1/8_c1_tanh"
  top: "tanh_conv_s1/8_c1"
  type: "TanH"
}
layer {
  name: "eltwise_s1/8_c1_right"
  type: "Eltwise"
  bottom: "sigmoid_s1/8_i1"
  bottom: "tanh_conv_s1/8_c1"
  top: "eltwise_s1/8_c1_right"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "eltwise_s1/8_c1_left"
  type: "Eltwise"
  bottom: "sigmoid_s1/8_f1"
  bottom: "eltwise_s1/8_c0"
  top: "eltwise_s1/8_c1_left"
  eltwise_param {
    operation: PROD
  }
}
layer {
  name: "eltwise_s1/8_c1"
  type: "Eltwise"
  bottom: "eltwise_s1/8_c1_left"
  bottom: "eltwise_s1/8_c1_right"
  top: "eltwise_s1/8_c1"
  eltwise_param {
    operation: SUM
  }
}


## h1 ##
layer {
  name: "tanh_s1/8_c1"
  bottom: "eltwise_s1/8_c1"
  top: "tanh_s1/8_c1"
  type: "TanH"
}
layer {
  name: "eltwise_s1/8_h1"
  type: "Eltwise"
  bottom: "sigmoid_s1/8_o1"
  bottom: "tanh_s1/8_c1"
  top: "eltwise_s1/8_h1"
  eltwise_param {
    operation: PROD
  }
}

## i2 ##
layer {
  bottom: "concat_s1/8_FDM"
  top: "conv_s1/8_i2_left"
  name: "conv_s1/8_i2_left"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "eltwise_s1/8_h1"
  top: "conv_s1/8_i2_right"
  name: "conv_s1/8_i2_right"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "conv_s1/8_i2"
  type: "Eltwise"
  bottom: "conv_s1/8_i2_left"
  bottom: "conv_s1/8_i2_right"
  top: "conv_s1/8_i2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "sigmoid_s1/8_i2"
  bottom: "conv_s1/8_i2"
  top: "sigmoid_s1/8_i2"
  type: "Sigmoid"
}

## f2 ##
layer {
  bottom: "concat_s1/8_FDM"
  top: "conv_s1/8_f2_left"
  name: "conv_s1/8_f2_left"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  bottom: "eltwise_s1/8_h1"
  top: "conv_s1/8_f2_right"
  name: "conv_s1/8_f2_right"
  type: "Convolution"
  param {
    lr_mult: 10
    decay_mult: 1
  }
  param {
    lr_mult: 20
    decay_mult: 0
  }
  convolution_param {
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    num_output: 32
    pad: 1
    kernel_size: 3
  }
}
layer {
  name: "conv_s1/8_f2"
  type: "Eltwise"
  bottom: "conv_s1/8_f2_left"
  bottom: "conv_s1/8_f2_right"
  top: "conv_s1/8_f2"
  eltwise_param {
    operation: SUM
  }
}
layer {
